maoravni/Dev/FEC/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/hal/uart/fsl_uart_hal_interrupts_and_dma.c
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include "fsl_uart_hal.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_configure_interrupts
 * Description   : Configure the UART module interrupts to enable/disable various interrupt sources.
 * This function allows the user to configure all of the UART interrupts with one function call.
 * The user will first need to initialize and pass in a structure of type uart_interrupt_config_t
 * which sets the configuration of each interrupt.
 *
 *END**************************************************************************/
void uart_hal_configure_interrupts(uint32_t uartInstance,
                                   const uart_interrupt_config_t * interruptConfig)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    uint8_t temp;

    /* configure uart interrupt enables*/
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        /* 0 - disable interrupt, 1 - enable interrupt*/

        /* UART BDH register  */
        temp = HW_UART0_BDH_RD() & ~(BM_UART0_BDH_LBKDIE|BM_UART0_BDH_RXEDGIE);
        temp |= BF_UART0_BDH_LBKDIE(interruptConfig->linBreakDetect)
               |BF_UART0_BDH_RXEDGIE(interruptConfig->rxActiveEdge);
        HW_UART0_BDH_WR(temp);

        /* UART C2 register  */
        temp = HW_UART0_C2_RD() & ~(BM_UART0_C2_TIE|BM_UART0_C2_TCIE|BM_UART0_C2_RIE|
                                    BM_UART0_C2_ILIE);
        temp |= BF_UART0_C2_TIE(interruptConfig->transmitDataRegisterEmpty)
               |BF_UART0_C2_TCIE(interruptConfig->transmitComplete)
               |BF_UART0_C2_RIE(interruptConfig->receiverDataRegisterFull)
               |BF_UART0_C2_ILIE(interruptConfig->idleLine);
        HW_UART0_C2_WR(temp);

        /* UART C3 register  */
        temp = HW_UART0_C3_RD() & ~(BM_UART0_C3_ORIE|BM_UART0_C3_NEIE|BM_UART0_C3_FEIE|
                                    BM_UART0_C3_PEIE);
        temp |= BF_UART0_C3_ORIE(interruptConfig->receiverOverrun)
               |BF_UART0_C3_NEIE(interruptConfig->noiseErrorFlag)
               |BF_UART0_C3_FEIE(interruptConfig->frameErrorFlag)
               |BF_UART0_C3_PEIE(interruptConfig->parityErrorFlag);
        HW_UART0_C3_WR(temp);

    }
    else
#endif
    {
        /* 0 - disable interrupt, 1 - enable interrupt*/

        /* UART BDH register  */
        temp = HW_UART_BDH_RD(uartInstance) & ~(BM_UART_BDH_LBKDIE|BM_UART_BDH_RXEDGIE);
        temp |= BF_UART_BDH_LBKDIE(interruptConfig->linBreakDetect)
               |BF_UART_BDH_RXEDGIE(interruptConfig->rxActiveEdge);
        HW_UART_BDH_WR(uartInstance, temp);

        /* UART C2 register  */
        temp = HW_UART_C2_RD(uartInstance) & ~(BM_UART_C2_TIE|BM_UART_C2_TCIE|BM_UART_C2_RIE|
                                               BM_UART_C2_ILIE);
        temp |= BF_UART_C2_TIE(interruptConfig->transmitDataRegisterEmpty)
               |BF_UART_C2_TCIE(interruptConfig->transmitComplete)
               |BF_UART_C2_RIE(interruptConfig->receiverDataRegisterFull)
               |BF_UART_C2_ILIE(interruptConfig->idleLine);
        HW_UART_C2_WR(uartInstance, temp);

        /* UART C3 register  */
        temp = HW_UART_C3_RD(uartInstance) & ~(BM_UART_C3_ORIE|BM_UART_C3_NEIE|BM_UART_C3_FEIE|
                                               BM_UART_C3_PEIE);
        temp |= BF_UART_C3_ORIE(interruptConfig->receiverOverrun)
               |BF_UART_C3_NEIE(interruptConfig->noiseErrorFlag)
               |BF_UART_C3_FEIE(interruptConfig->frameErrorFlag)
               |BF_UART_C3_PEIE(interruptConfig->parityErrorFlag);
        HW_UART_C3_WR(uartInstance, temp);
#if FSL_FEATURE_UART_HAS_FIFO
        /* UART CFIFO register  */
        temp = HW_UART_CFIFO_RD(uartInstance) & ~(BM_UART_CFIFO_TXOFE|BM_UART_CFIFO_RXUFE);
        temp |= BF_UART_CFIFO_TXOFE(interruptConfig->txFifoOverflow)
               |BF_UART_CFIFO_RXUFE(interruptConfig->rxFifoUnderflow);
        HW_UART_CFIFO_WR(uartInstance, temp);
#endif
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_enable_break_detect_interrupt
 * Description   : Enable the break_detect_interrupt.
 *
 *END**************************************************************************/
void uart_hal_enable_break_detect_interrupt(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* Enable break detect interrupt LBKDIE*/
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        HW_UART0_BDH_SET(BM_UART0_BDH_LBKDIE);
    }
    else
#endif
    {
        HW_UART_BDH_SET(uartInstance, BM_UART_BDH_LBKDIE);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_disable_break_detect_interrupt
 * Description   : Disable the break_detect_interrupt.
 *
 *END**************************************************************************/
void uart_hal_disable_break_detect_interrupt(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* Disable break detect interrupt LBKDIE*/
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        HW_UART0_BDH_CLR(BM_UART0_BDH_LBKDIE);
    }
    else
#endif
    {
        HW_UART_BDH_CLR(uartInstance, BM_UART_BDH_LBKDIE);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_is_break_detect_interrupt_enabled
 * Description   : Get the configuration of the break_detect_interrupt enable setting.
 *
 *END**************************************************************************/
bool uart_hal_is_break_detect_interrupt_enabled(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

