maoravni/Dev/FEC/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/hal/uart/fsl_uart_hal_interrupts_and_dma.c
    /* return interrupt enable condition of LBKDIE*/
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        return HW_UART0_BDH.B.LBKDIE;
    }
    else
#endif
    {
        return HW_UART_BDH(uartInstance).B.LBKDIE;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_enable_rx_active_edge_interrupt
 * Description   : Enable the rx_active_edge_interrupt.
 *
 *END**************************************************************************/
void uart_hal_enable_rx_active_edge_interrupt(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* Receiver Active Edge interrupt enable*/
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        HW_UART0_BDH_SET(BM_UART0_BDH_RXEDGIE);
    }
    else
#endif
    {
        HW_UART_BDH_SET(uartInstance, BM_UART_BDH_RXEDGIE);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_disable_rx_active_edge_interrupt
 * Description   : Disable the rx_active_edge_interrupt.
 *
 *END**************************************************************************/
void uart_hal_disable_rx_active_edge_interrupt(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* Receiver Active Edge interrupt disable*/
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        HW_UART0_BDH_CLR(BM_UART0_BDH_RXEDGIE);
    }
    else
#endif
    {
        HW_UART_BDH_CLR(uartInstance, BM_UART_BDH_RXEDGIE);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_is_rx_active_edge_interrupt_enabled
 * Description   : Get the configuration of the rx_active_edge_interrupt enable setting.
 *
 *END**************************************************************************/
bool uart_hal_is_rx_active_edge_interrupt_enabled(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* return interrupt enable condition of RXEDGIE*/
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        return HW_UART0_BDH.B.RXEDGIE;
    }
    else
#endif
    {
        return HW_UART_BDH(uartInstance).B.RXEDGIE;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_enable_tx_data_register_empty_interrupt
 * Description   : Enable the tx_data_register_empty_interrupt.
 *
 *END**************************************************************************/
void uart_hal_enable_tx_data_register_empty_interrupt(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* transmit interrupt enable for TDRE (transmit data register empty)*/
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        HW_UART0_C2_SET(BM_UART0_C2_TIE);
    }
    else
#endif
    {
        HW_UART_C2_SET(uartInstance, BM_UART_C2_TIE);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_disable_tx_data_register_empty_interrupt
 * Description   : Disable the tx_data_register_empty_interrupt.
 *
 *END**************************************************************************/
void uart_hal_disable_tx_data_register_empty_interrupt(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* transmit interrupt disable for TDRE (transmit data register empty)*/
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        HW_UART0_C2_CLR(BM_UART0_C2_TIE);
    }
    else
#endif
    {
        HW_UART_C2_CLR(uartInstance, BM_UART_C2_TIE);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_is_tx_data_register_empty_interrupt_enabled
 * Description   : Get the configuration of the tx_data_register_empty_interrupt enable stting.
 *
 *END**************************************************************************/
bool uart_hal_is_tx_data_register_empty_interrupt_enabled(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* return interrupt enable condition of TIE  */
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        return HW_UART0_C2.B.TIE;
    }
    else
#endif
    {
        return HW_UART_C2(uartInstance).B.TIE;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_enable_transmission_complete_interrupt
 * Description   : Enable the transmission_complete_interrupt.
 *
 *END**************************************************************************/
void uart_hal_enable_transmission_complete_interrupt(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* transmission complete interrupt enable */
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        HW_UART0_C2_SET(BM_UART0_C2_TCIE);
    }
    else
#endif
    {
        HW_UART_C2_SET(uartInstance, BM_UART_C2_TCIE);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_disable_transmission_complete_interrupt
 * Description   : Disable the transmission_complete_interrupt.
 *
 *END**************************************************************************/
void uart_hal_disable_transmission_complete_interrupt(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* transmission complete interrupt disable */
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        HW_UART0_C2_CLR(BM_UART0_C2_TCIE);
    }
    else
#endif
    {
        HW_UART_C2_CLR(uartInstance, BM_UART_C2_TCIE);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_is_transmission_complete_interrupt_enabled
 * Description   : Get the configuration of the transmission_complete_interrupt enable setting.
 *
 *END**************************************************************************/
bool uart_hal_is_transmission_complete_interrupt_enabled(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* return interrupt enable condition of TCIE  */
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        return HW_UART0_C2.B.TCIE;
    }
    else
#endif
    {
        return HW_UART_C2(uartInstance).B.TCIE;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_enable_rx_data_register_full_interrupt
 * Description   : Enable the rx_data_register_full_interrupt.
 *
 *END**************************************************************************/
void uart_hal_enable_rx_data_register_full_interrupt(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

    /* receiver interrupt enable for receiver data register full (RDRF)*/
#if FSL_FEATURE_UART_HAS_LOW_POWER_UART_SUPPORT
    if (uartInstance == 0)
    {
        HW_UART0_C2_SET(BM_UART0_C2_RIE);
    }
    else
#endif
    {
        HW_UART_C2_SET(uartInstance, BM_UART_C2_RIE);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : uart_hal_disable_rx_data_register_full_interrupt
 * Description   : Disable the rx_data_register_full_interrupt.
 *
 *END**************************************************************************/
void uart_hal_disable_rx_data_register_full_interrupt(uint32_t uartInstance)
{
    assert(uartInstance < UART_INSTANCE_COUNT);

